//! @file ConstParams.cc
//! @brief 定数値格納用クラス
//!        ARCSに必要な定数値を格納します。
//! @date 2024/06/13
//! @author Yokokura, Yuki
//
// Copyright (C) 2011-2024 Yokokura, Yuki
// MIT License. For details, see the LICENSE file.

#include "ConstParams.hh"

using namespace ARCS;

// 実験データCSVファイルの設定
//const std::string ConstParams::DATA_NAME("DATA.csv");				//!< CSVファイル名

// 任意変数値表示の設定
const std::string ConstParams::INDICVARS_FORMS[INDICVARS_MAX] = {
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
	"% 13.4f",	// 任意に表示したい変数値の表示形式(printfの書式と同一)
};

// 時系列グラフプロットの各部設定
//!< @brief 縦軸ラベルの設定
const std::array<std::string, ConstParams::PLOT_MAX> ConstParams::PLOT_FLABEL = {
	"---------- [-]",	// プロット0
	"---------- [-]",	// プロット1
	"---------- [-]",	// プロット2
	"---------- [-]",	// プロット3
	"---------- [-]",	// プロット4
	"---------- [-]",	// プロット5
	"---------- [-]",	// プロット6
	"---------- [-]",	// プロット7
	"---------- [-]",	// プロット8
	"---------- [-]",	// プロット9
	"---------- [-]",	// プロット10
	"---------- [-]",	// プロット11
	"---------- [-]",	// プロット12
	"---------- [-]",	// プロット13
	"---------- [-]",	// プロット14
	"---------- [-]",	// プロット15
};

//! @brief 時系列グラフプロットの縦軸書式
const std::array<std::string, ConstParams::PLOT_MAX> ConstParams::PLOT_FFORMAT = {
	"%6.1f",	// プロット0
	"%6.1f",	// プロット1
	"%6.1f",	// プロット2
	"%6.1f",	// プロット3
	"%6.1f",	// プロット4
	"%6.1f",	// プロット5
	"%6.1f",	// プロット6
	"%6.1f",	// プロット7
	"%6.1f",	// プロット8
	"%6.1f",	// プロット9
	"%6.1f",	// プロット10
	"%6.1f",	// プロット11
	"%6.1f",	// プロット12
	"%6.1f",	// プロット13
	"%6.1f",	// プロット14
	"%6.1f",	// プロット15
};

//! @brief 時系列グラフプロットの変数の名前
const std::array<
	std::array<std::string, ConstParams::PLOT_VAR_MAX>,
	ConstParams::PLOT_MAX
> ConstParams::PLOT_VAR_NAMES = {{
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット0
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット1
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット2
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット3
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット4
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット5
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット6
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット7
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット8
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット9
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット10
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット11
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット12
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット13
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット14
	{"VAR-00", "VAR-01", "VAR-02", "VAR-03", "VAR-04", "VAR-05", "VAR-06", "VAR-07",},	// プロット15
}};
